{
    "version": "https://jsonfeed.org/version/1",
    "title": "Dental Insurance",
    "description": "",
    "home_page_url": "https://automaniacmrk.github.io/DentalInsurance",
    "feed_url": "https://automaniacmrk.github.io/DentalInsurance/feed.json",
    "user_comment": "",
    "author": {
        "name": "Dentist"
    },
    "items": [
        {
            "id": "https://automaniacmrk.github.io/DentalInsurance/weve-put-together-this-handy-guide-to-help-you-understand-your-dental-insurance-coverage.html",
            "url": "https://automaniacmrk.github.io/DentalInsurance/weve-put-together-this-handy-guide-to-help-you-understand-your-dental-insurance-coverage.html",
            "title": "We&#x27;Ve Put Together This Handy Guide To Help You Understand Your Dental Insurance Coverage",
            "summary": "Eligible: All employees who are eligible to receive full benefits as well as retirees Who's covered: You and your eligible family members Who pays the premium: UC and retirees subject to graduated eligibility You may enroll your legal spouse, domestic partner, and dependent children up&hellip;",
            "content_html": "<p><img loading=\"lazy\" src=\"https://watersidedentalsarasota.com/app/uploads/sites/51/2020/03/1bc9fc8d01f0604f14fd8452654906d8_Red-Bank-Dentist-Chattanooga-TN-All-About-Dental-Insurance-Benefits-Plans-More-1500-c-90.jpg\" data-is-external-image=\"true\"  alt=\"Dental Insurance\" data-cke-saved-src=\" https://watersidedentalsarasota.com/app/uploads/sites/51/2020/03/1bc9fc8d01f0604f14fd8452654906d8_Red-Bank-Dentist-Chattanooga-TN-All-About-Dental-Insurance-Benefits-Plans-More-1500-c-90.jpg\"></p>\n<h2>We'Ve Put Together This Handy Guide To Help You Understand Your Dental Insurance Coverage</h2>\n<ul>\n<li>Read and review the benefits booklet for the fully detailed outline of all that is included in your dental benefits.</li>\n<li>Deductibles</li>\n<li>Maximums</li>\n<li>Reimbursement levels</li>\n<li>Waiting period</li>\n</ul>\n<h2>Eligibility</h2>\n<p>Eligible: All employees who are eligible to receive full benefits as well as retirees</p>\n<p>Who's covered: You and your eligible family members</p>\n<p>Who pays the premium: UC and retirees subject to graduated eligibility</p>\n<p><img loading=\"lazy\" src=\"https://www.rootvisionendo.com/wp-content/uploads/2015/01/Dental-insurance-picture.jpg\" data-is-external-image=\"true\"  alt=\"Dental Insurance\" data-cke-saved-src=\" https://www.rootvisionendo.com/wp-content/uploads/2015/01/Dental-insurance-picture.jpg\"></p>\n<h2>Dependent Eligibility</h2>\n<p>You may enroll your legal spouse, domestic partner, and dependent children up to age 26, when you experience a family status change, or during the annual Open Enrollment period.</p>\n<h2>Learn more about our Dental Insurance Plans</h2>\n<p>Chamber of Commerce offers four tiers of dental plans to cover a variety of needs and budgets: Diamond, Achiever, Core, and Starter**.</p>\n<p><img loading=\"lazy\" src=\"https://www.ada.org/-/media/project/ada-organization/ada/ada-org/images/resources/practice/tpp_successful_claim_submit_1110x700.jpg?rev=65b86aad48f84635ace3267034c7f46c&amp;w=1100&amp;hash=C26F7C253A3E2066B99FB813B79B6FD0\" data-is-external-image=\"true\"  alt=\"Dental Insurance\" data-cke-saved-src=\" https://www.ada.org/-/media/project/ada-organization/ada/ada-org/images/resources/practice/tpp_successful_claim_submit_1110x700.jpg?rev=65b86aad48f84635ace3267034c7f46c&amp;w=1100&amp;hash=C26F7C253A3E2066B99FB813B79B6FD0\"></p>\n<h2>Union-Sponsored Dental Plans: Bargaining Units 5 And 6</h2>\n<p>Every eligible Bargaining Unit 6 employee must enroll in Trust plans, except if they are covered by other state-sponsored dental insurance through their spouse.</p>\n<p>Bargaining Unit 5 or 6 employees should contact the Benefit Trust to find out more about their benefits and premiums for their union-sponsored dental plans.</p>\n<h2>Deltacare Usa, Metlife,* Premier Access, And Western Dental</h2>\n<ul>\n<li>Dentists receive a flat fee for each member assigned to their offices.</li>\n<li>The majority of basic services are free.</li>\n<li>The monthly premium is fully paid by the state. No premium is deducted from your monthly pay warrant.</li>\n</ul>\n<p>For more information or a list of member dentists, contact the plans at:</p>\n<p><img loading=\"lazy\" src=\"https://blog.solsticebenefits.com/hubfs/AdobeStock_327291399.jpeg\" data-is-external-image=\"true\"  alt=\"Dental Insurance\" data-cke-saved-src=\" https://blog.solsticebenefits.com/hubfs/AdobeStock_327291399.jpeg\"></p>\n<h2>Dental Coverage Is Available 2 Ways</h2>\n<p>How can you preview your dental plan?</p>\n<p>Simply click the button to answer some income- and household question. Then you can view both separate and combined health plans.</p>\n<p>SEE HEALTH &amp; DENTAL PLANS &amp; PRICES</p>",
            "author": {
                "name": "Dentist"
            },
            "tags": [
            ],
            "date_published": "2022-06-22T10:01:48-07:00",
            "date_modified": "2022-06-27T06:11:31-07:00"
        },
        {
            "id": "https://automaniacmrk.github.io/DentalInsurance/how-dental-insurance-works-and-what-it-covers.html",
            "url": "https://automaniacmrk.github.io/DentalInsurance/how-dental-insurance-works-and-what-it-covers.html",
            "title": "How Dental Insurance Works and what it covers",
            "summary": "As with most types of health insurance, your dental insurance plan typically includes a deductible, co-pays, co-insurance, and a maximum annual benefit. Here's a quick breakdown of how these features apply to your dental care. The type and policy you choose will determine your deductible,&hellip;",
            "content_html": "<p><img loading=\"lazy\" src=\"https://www.deltadental.com/content/dam/ddpa/us/en/articles/why-dental-insurance-is-a-win-win-for-small-businesses-and-their-employees-/small%20business%20win.png\" data-is-external-image=\"true\"  alt=\"Dental Insurance\" data-cke-saved-src=\" https://www.deltadental.com/content/dam/ddpa/us/en/articles/why-dental-insurance-is-a-win-win-for-small-businesses-and-their-employees-/small%20business%20win.png\"></p>\n<h2>How Dental Insurance Works and what it covers</h2>\n<p>As with most types of health insurance, your dental insurance plan typically includes a deductible, co-pays, co-insurance, and a maximum annual benefit. Here's a quick breakdown of how these features apply to your dental care.</p>\n<ul>\n<li>The Deductible is what you have to forgo your insurance in order to cover the cost of your coverage.</li>\n<li>Co-pay: A co-pay is a set dollar amount your dental insurance carrier requires you to pay for certain services and procedures. Your deductible may be reduced depending on which policy you have.</li>\n<li>The amount of dental care that you pay after meeting your deductible is determined by co-insurance. If you have 30% coinsurance, your policy pays 30%.</li>\n<li>Maximum annual benefit: This is the maximum amount your insurance pays out for each person on your policy during the calendar year.</li>\n</ul>\n<p>The type and policy you choose will determine your deductible, copay, coinsurance and maximum annual benefits. Progressive Health by eHealth offers four types of plans, with varying degrees of coverage and costs.</p>\n<ul>\n<li>DPPO: This allows you to visit most dentists. However, in-network dental care is more affordable. There is a copay, deductible, and annual maximum benefit.</li>\n<li>DHMO: Only one facility or dentist must be chosen from the network. Out-of-network providers are not covered. There is no maximum or deductible, and you only pay co-pay.</li>\n<li>Fee-for service: This means that you can see almost all dentists, but there is a charge.</li>\n<li>Discount plans: You have no limitations on your choice of dentist. With each visit, you pay a discounted fee and pay the rest of your care out of pocket.</li>\n</ul>\n<p>Before you apply for dental insurance, ensure that you are comfortable with the network limitations and any out-of-pocket expenses.</p>\n<h2>The Dental Insurance You Need At The Price You Want</h2>\n<p>Chamber of Commerce makes it easy to quickly find the right dental plan for you. When you use eHealth's free plan finders and comparison tools, you can quickly compare the best plans available in your area from among 270+ carriers. Chamber of Commerce plans cover basic and preventative dental care. Get a quote for dental insurance today and give your teeth the care they need.</p>\n<p>Looking for other types of plans? See more health insurance options. Have questions about health insurance? Get more information with the Health Insurance 101 guide.</p>",
            "author": {
                "name": "Dentist"
            },
            "tags": [
            ],
            "date_published": "2022-06-22T10:00:28-07:00",
            "date_modified": "2022-06-27T06:09:33-07:00"
        },
        {
            "id": "https://automaniacmrk.github.io/DentalInsurance/finding-dental-coverage-that-is-insured-in-california.html",
            "url": "https://automaniacmrk.github.io/DentalInsurance/finding-dental-coverage-that-is-insured-in-california.html",
            "title": "Finding Dental Coverage that is insured In California",
            "summary": "Finding Dental Coverage that is insured In California Health plans purchased through the Covered California Health Exchange automatically include pediatric dental benefits for children up to age 18. A lot of plans available through the Exchange include coverage for pediatric dentistry. California offers dental coverage&hellip;",
            "content_html": "<h2>Finding Dental Coverage that is insured In California</h2>\n<p>Health plans purchased through the Covered California Health Exchange automatically include pediatric dental benefits for children up to age 18. A lot of plans available through the Exchange include coverage for pediatric dentistry. California offers dental coverage for adults. This can be purchased as either a standalone policy or as an addition to existing health insurance. Sometimes, stand-alone plans offer richer benefits. The exception to this rule is when dental insurance is added to an employer's health plan. Sometimes, small business dental plans offer greater benefits. Orthodontia coverage can be cheaper. If your company offers group insurance, your Health Insurance Agent/Broker can help you find coverage for dental needs.</p>\n<p>These are the terms most commonly used to describe dental insurance. Becoming acquainted with them will help you in understanding California <a href=\"https://www.chamberplan.ca/product/group-benefits/dental-coverage\">dental insurance policies</a> and in choosing the one that is right for you.</p>\n<p><img loading=\"lazy\" src=\"https://s3.ap-south-1.amazonaws.com/healthinsurances3.com/prod/imagegallery/Dental-Insurance-Coverage-Claims-and-Exclusions.jpg\" data-is-external-image=\"true\"  alt=\"Dental Insurance\" data-cke-saved-src=\" https://s3.ap-south-1.amazonaws.com/healthinsurances3.com/prod/imagegallery/Dental-Insurance-Coverage-Claims-and-Exclusions.jpg\"></p>\n<h2>Uniform Dental</h2>\n<p>Uniform Dental coverage is available only if you are enrolled in Wisconsin Public Employers Group Health Insurance Program or the State of Wisconsin. This insurance covers children's, diagnostic, preventive and basic orthodontic services.</p>\n<p>The coverage you receive for your dental needs will match the coverage you have for your other health benefits. If you choose family insurance that includes dental coverage, you'll be included in family dental coverage. Individual dental coverage will also be available if you choose individual insurance that includes dental coverage. Uniform Dental coverage is an option to add on to your insurance premium.</p>\n<p>Enrollment continues each year unless you cancel during the annual open enrollment period.</p>\n<h2>Delta Dental Ppo</h2>\n<p>The Delta Dental PPO plan, available worldwide, provides you and your family with the flexibility to choose any licensed dentist or specialist. Your share of the cost of services depends on whether you use a dentist in Delta Dental's PPO network or an out-of-network dentist.</p>\n<p>If you choose a PPO dentist, you will usually pay less for services. PPO dentists will accept lower fees for their services. The dentist will also complete all claims forms and send them to you free of charge. The cost of preventive dental services, including cleanings and exams, are free. Basic dentistry such as fillings or extractions is covered up to 80 percent.</p>\n<p>Delta has more than 43,700 PPO dentists in California and 234,000 nationwide. To see a list of Delta Dental PPO dentists, visit the Delta Dental website.</p>\n<p>Although Premier dentists at Delta Dental aren't part of the PPO network, they have agreed to pay a lower fee and will submit claims forms on your behalf. Delta Dental covers 75 percent of basic dentistry costs after annual deductible if you use a Premier dentist, up to $1,500 per year. You may need to submit a claim form to Delta Dental if you visit a non-affiliated dentist. Delta cannot assure you what percentage of the charged fees may be covered.</p>",
            "author": {
                "name": "Dentist"
            },
            "tags": [
            ],
            "date_published": "2022-06-22T09:59:36-07:00",
            "date_modified": "2022-07-02T08:24:59-07:00"
        },
        {
            "id": "https://automaniacmrk.github.io/DentalInsurance/what-are-the-insurance-coverage-for-dental.html",
            "url": "https://automaniacmrk.github.io/DentalInsurance/what-are-the-insurance-coverage-for-dental.html",
            "title": "What are the insurance coverage for dental?",
            "summary": "What are the insurance coverage for dental? Deltacare(r)Usa Chamber of Commerce, a dental HMO provides comprehensive benefits for you and your loved ones and quick referrals to specialists. To enroll, you must be a resident of California. You will be referred to specialist dentists if&hellip;",
            "content_html": "<h1>What are the insurance coverage for dental?</h1>\n<h1><img loading=\"lazy\" src=\"https://lirp.cdn-website.com/c923dd81/dms3rep/multi/opt/Dental+Insurance+Accepted+Updated+5.21-731w.jpg\" data-is-external-image=\"true\"  alt=\"Dental Insurance\" data-cke-saved-src=\" https://lirp.cdn-website.com/c923dd81/dms3rep/multi/opt/Dental+Insurance+Accepted+Updated+5.21-731w.jpg\"></h1>\n<h2>Deltacare(r)Usa</h2>\n<p>Chamber of Commerce, a dental HMO provides comprehensive benefits for you and your loved ones and quick referrals to specialists. To enroll, you must be a resident of California.</p>\n<p>You will be referred to specialist dentists if necessary when you sign up for network dentistry. The Chamber of Commerce network consists of private practice dental facilities that have been screened by Chamber of Commerce for quality. Some areas of California have more network providers than others, so be sure there are dentists available in your area before choosing this plan.</p>\n<p>To change your dentist, you can call the Chamber of Commerce Customer Service Number to make the request. Visit the Delta Dental website for a list of participating dentists.</p>\n<h2>What are the insurance coverage for dental?</h2>\n<p>Different dental insurance plans cover different services. The most basic plan covers common preventative and treatment services, with or without co-pays.</p>\n<ul>\n<li>Check-ups</li>\n<li>Cleaning your teeth</li>\n<li>Cavity fillings (using silver/amalgam)</li>\n<li>X-rays</li>\n</ul>\n<p>Other plans may provide more extensive coverage, helping to pay for major dental procedures, including:</p>\n<ul>\n<li>Root canals</li>\n<li>Extractions</li>\n<li>Crowns</li>\n<li>Bridges</li>\n<li>Braces</li>\n<li>Dental implants</li>\n</ul>\n<p>If there are certain services or procedures you'd like to see included in your dental insurance, check the details of each plan during the quoting process. For questions regarding your coverage options, you can use Chamber of Commerce chat support 24/7 or call 1-800-665-3365 to speak with a dedicated expert.</p>\n<p><img loading=\"lazy\" src=\"https://www.thebalance.com/thmb/CBRHdOI2XNhTpPCL-2OdzxPKMmo=/1500x1000/filters:fill(auto\" data-is-external-image=\"true\"  alt=\"Dental Insurance\" data-cke-saved-src=\" https://www.thebalance.com/thmb/CBRHdOI2XNhTpPCL-2OdzxPKMmo=/1500x1000/filters:fill(auto\"></p>\n<h2>Important Reminders</h2>\n<ul>\n<li>California legalizes same-sex marriages in accordance with United States Supreme Court rulings of June 26, 2013. For enrollment and benefit eligibility purposes, departments will accept certificates of same-sex marriage without discrimination based on gender. Employees married to a same-sex spouse prior to or following the US Supreme Court decisions on June 26th, 2013, or who were in a domestic partnership but married following the federal court decision, and wish to add their spouse and/or their spouse's dependent children, have the opportunity to enroll their spouse and their spouse's eligible dependent children onto their dental. If already in a same-sex marriage prior to the Court's decisions and had your spouse enrolled on your benefits, the state was obligated to report those benefits as income and withhold additional federal income taxes, social security and Medicare from your paycheck. If this applies to you, you must notify your departmental personnel office and have them assist you to stop the additional federal tax withholding. Otherwise, your tax status will remain \"as is\" and the additional federal income taxes, Social Security and Medicare will continue to be withheld. For further assistance, please contact the departmental personnel office.</li>\n</ul>\n<p>Consistent with the June 26, 2013, United States Supreme Court decisions, same-sex marriages are legally recognized in California. Departments will accept same-sex marriage certificates for benefit eligibility and enrollment without regard to gender. Employees married to a same-sex spouse prior to or following the US Supreme Court decisions on June 26th, 2013, or who were in a domestic partnership but married following the federal court decision, and wish to add their spouse and/or their spouse's dependent children, have the opportunity to enroll their spouse and their spouse's eligible dependent children onto their dental. If already in a same-sex marriage prior to the Court's decisions and had your spouse enrolled on your benefits, the state was obligated to report those benefits as income and withhold additional federal income taxes, social security and Medicare from your paycheck. You must inform your departmental personnel to have the federal tax withheld stopped. Your tax status, including the withholding of additional federal income taxes and Medicare, will not change. For further assistance, please contact the departmental personnel office.</p>\n<ul>\n<li>Dependent children employed by the state and eligible for state-sponsored dental plans are also eligible to enroll in their parent's state-sponsored dental plan.</li>\n</ul>\n<p>Dependent children employed by the state and eligible for state-sponsored dental plans are also eligible to enroll in their parent's state-sponsored dental plan.</p>",
            "author": {
                "name": "Dentist"
            },
            "tags": [
            ],
            "date_published": "2022-06-22T09:58:22-07:00",
            "date_modified": "2022-06-27T06:07:43-07:00"
        },
        {
            "id": "https://automaniacmrk.github.io/DentalInsurance/dental-insurance.html",
            "url": "https://automaniacmrk.github.io/DentalInsurance/dental-insurance.html",
            "title": "Dental Insurance",
            "summary": "Dental Insurance Important Reminders Consistent with the June 26, 2013, United States Supreme Court decisions, same-sex marriages are legally recognized in California. Departments will accept same-sex marriage certificates for benefit eligibility and enrollment without regard to gender. If an employee is married to the same-sex&hellip;",
            "content_html": "<h1>Dental Insurance</h1>\n<h2><img loading=\"lazy\" src=\"https://www.crovattoandedwards.com/assets/images/dental-insurance-1.jpg\" data-is-external-image=\"true\"  alt=\"Dental Insurance\" width=\"80%\" height=\"auto\"></h2>\n<h2>Important Reminders</h2>\n<p>Consistent with the June 26, 2013, United States Supreme Court decisions, same-sex marriages are legally recognized in California. Departments will accept same-sex marriage certificates for benefit eligibility and enrollment without regard to gender. If an employee is married to the same-sex spouse before or after the US Supreme Court decision on June 26, 2013, or if they were married in a domestic partner but divorced following that federal court ruling, the department will accept the certificate. Employees who wish to include their spouse or their dependent children into their dental benefits have the option to do so. If already in a same-sex marriage prior to the Court's decisions and had your spouse enrolled on your benefits, the state was obligated to report those benefits as income and withhold additional federal income taxes, social security and Medicare from your paycheck. You must inform your departmental personnel to have the federal tax withheld stopped. Your tax status, including the withholding of additional federal income taxes and Medicare, will not change. For further assistance, please contact the departmental personnel office.</p>\n<ul>\n<li>Dependent children employed by the state and eligible for state-sponsored dental plans are also eligible to enroll in their parent's state-sponsored dental plan.</li>\n</ul>\n<p>Dependent children employed by the state and eligible for state-sponsored dental plans are also eligible to enroll in their parent's state-sponsored dental plan.</p>\n<h2>Delta Dental Preferred Provider Option (Ppo) - Group #9946</h2>\n<ul>\n<li>The state-sponsored Delta Dental Preferred Provider Option (PPO) plan provides services through its network of participating dentists and allows you to see any dentist of your choice world-wide and still be covered.</li>\n<li>While your current dentist might be a Delta Dental PPO member, not all Delta dentists can join the PPO network. Your share of dentist fees may be significantly higher if you are not part of the PPO network. You may contact Delta Dental to ensure there's a PPO provider available in your service area.</li>\n<li>The fee-for service agreement between Delta Dental and your PPO provider determines the cost of services. Each type of treatment is not covered by the plan. Based on what type of treatment the member receives, any balance owed will be paid by them.</li>\n</ul>\n<p>The amount of your monthly premium is deducted from your monthly pay warrant according to the number of enrolled dependents</p>\n<h2><img loading=\"lazy\" src=\"https://dentistinleessummit.com/wp-content/uploads/2017/12/dental-insurance-companies-300x253.png\" data-is-external-image=\"true\"  alt=\"Dental Insurance\" width=\"80%\" height=\"auto\"></h2>\n<h2>Finding Dental Coverage In California</h2>\n<p>Chambers of Commerce health plans automatically provide pediatric dental care for children under 18. Many plans that are available off the Exchange also include pediatric dental insurance. Adults can get dental coverage in California by purchasing it as a supplement to their health insurance plan or on a stand-alone basis. Sometimes, stand-alone plans offer richer benefits. The exception to this rule is when dental insurance is added to an employer's health plan. Small business dental plans sometimes offer more benefits and orthodontia coverage may be less expensive to include. To find dental coverage, contact your Health Insurance Agent/Broker or your Human Resources Department, if your employer offers group health insurance.</p>\n<p>These are the terms most commonly used to describe dental insurance. Becoming acquainted with them will help you in understanding California dental insurance policies and in choosing the one that is right for you.</p>\n<h2>Chambers of Commerce</h2>\n<p>Chambers of Commerce, a dental HMO provides comprehensive benefits for you and your loved ones and quick referrals to specialists. To enroll, you must be a resident of California.</p>\n<p>You will be referred to specialist dentists if necessary when you sign up for network dentistry. The Chambers of Commerce network consists of private practice dental facilities that have been screened by Delta Dental for quality. Some areas of California have more network providers than others, so be sure there are dentists available in your area before choosing this plan.</p>\n<p>You may change your dentist at any time by calling the Chambers of Commerce Customer Service number to request the change. Visit the Chambers of Commerce website for a list of participating dentists.</p>\n<h2><img loading=\"lazy\" src=\"https://www.healthmarkets.com/wp-content/uploads/2015/08/Elderly-gentleman-speaking-with-dentist-e1586379651645-1280x720.jpg\" data-is-external-image=\"true\"  alt=\"Dental Insurance\" width=\"80%\" height=\"auto\"></h2>\n<h2>Enrollment</h2>\n<p>The deadline to sign up for a dental plan is 60 days after the date that you were hired or when you become eligible.</p>\n<ul>\n<li>If eligible, you may also enroll during the annual Open Enrollment period.</li>\n<li>Except as noted, new employees who are represented may only select a prepaid plan after they have worked for 24 months without any permanent breaks during the 24-month qualifying period. At the end of the 24-month period they will have 60 days to elect or change to the indemnity plan.</li>\n<li>The 24-month limit does not apply to employees in bargaining units 2, 7, 8, 16, 17, 18 and 19.</li>\n</ul>\n<h2>What does dental insurance cover?</h2>\n<p>Different dental insurance plans cover different services. The most basic plan covers common preventative and treatment services, with or without co-pays.</p>\n<ul>\n<li>Check-ups</li>\n<li>Teeth cleanings</li>\n<li>Cavity fillings (using silver/amalgam)</li>\n<li>X-rays</li>\n</ul>\n<p>Some plans offer more coverage and help pay for important dental procedures such as:</p>\n<ul>\n<li>Root canals</li>\n<li>Extractions</li>\n<li>Crowns</li>\n<li>Bridges</li>\n<li>Braces</li>\n<li>Dental implants</li>\n</ul>\n<p>Check the specifics of every plan to determine if you would like certain procedures or services included in your dental coverage. For questions regarding your coverage options, you can use Chambers of Commerce chat support 24/7 or call 1-800-665-3365 to speak with a dedicated expert.</p>\n<h2><img loading=\"lazy\" src=\"https://www.interdent.com/gentle-dental/wp-content/uploads/sites/2/2017/12/bigstock-213981982.jpg\" data-is-external-image=\"true\"  alt=\"Dental Insurance\" width=\"80%\" height=\"auto\"></h2>\n<h2>Uniform And Supplemental Dental Comparison Table</h2>\n<p>Uniform Dental</p>\n<p>Choose a Plan</p>\n<p>Select Plus Plan</p>\n<p>Employee - Monthly Payment (Premium)</p>\n<p>Your health insurance premium includes Uniform Dental.</p>\n<p>Supplemental dental is a separate deduction.</p>\n<p>$34.72 (Individual)</p>\n<p>$86.80 (Family)</p>\n<p>Retirement - Monthly payment (Premium).</p>\n<p>Your health insurance premium includes Uniform Dental.</p>\n<p>Additional dental deductions are a distinct one.</p>\n<p>$34.72 (Individual)</p>\n<p>$86.80 (Family)</p>\n<p>In-Network Providers</p>\n<p>There is no coverage beyond the network</p>\n<p>Delta Dental PPO or Premier providers</p>\n<p>Delta Dental PPO providers</p>\n<p>Delta Dental PPO or Premier providers</p>\n<p>Annual Deductible</p>\n<p>None</p>\n<p>$100 / person</p>\n<p>$25 / person</p>\n<p>Annual Benefit Max</p>\n<p>1,000 / Person</p>\n<p>1,000 / Person</p>\n<p>$2,500 per person</p>\n<p>Waiting Period</p>\n<p>None</p>\n<p>None</p>\n<p>None</p>\n<p>Routine evaluations, dental cleanings, sealants, bitewing and panoramic X-rays, fluoride treatments and pulp vitality tests</p>\n<p>100%</p>\n<p>No coverage</p>\n<p>No coverage</p>\n<p>Fillings</p>\n<p>100%</p>\n<p>No coverage</p>\n<p>No coverage</p>\n<p>Anesthesia (general and IV sedation)</p>\n<p>80%</p>\n<p>50%</p>\n<p>80%</p>\n<p>Emergency pain relief</p>\n<p>80%</p>\n<p>No coverage</p>\n<p>No coverage</p>\n<p>Periodontal Maintenance</p>\n<p>100%</p>\n<p>No coverage</p>\n<p>No coverage</p>\n<p>Crowns, bridges, dentures, implants</p>\n<p>No coverage</p>\n<p>50%</p>\n<p>60%</p>\n<p>Periodontics, oral surgery (save for maintenance), surgical extraction and root canal (endodontists).</p>\n<p>No coverage</p>\n<p>50%</p>\n<p>80%</p>\n<p>Non-surgical extractions</p>\n<p>90%</p>\n<p>No coverage</p>\n<p>No coverage</p>\n<p>Orthodontics Insurance</p>\n<p>50 % (Under the age of 19).</p>\n<p>No coverage</p>\n<p>50%</p>\n<p>(Regardless of age)</p>\n<p>Orthodontics Maximum Lifetime</p>\n<p>$1,500</p>\n<p>No coverage</p>\n<p>$1,500</p>\n<p>(in addition to Uniform Dental)</p>\n<h2>How Dental Insurance Works</h2>\n<p>Your dental plan will typically include a deductible and co-pays. Here's a quick breakdown of how these features apply to your dental care.</p>\n<ul>\n<li>Deductible: This is the amount you're required to pay out-of-pocket before your insurance kicks in.</li>\n<li>Co-pay: A co-pay is a set dollar amount your dental insurance carrier requires you to pay for certain services and procedures. Depending on the insurer or policy, your co-pay may count towards your deductible.</li>\n<li>Co-insurance: This determines what percentage of your dental care you'll pay for after you meet your deductible. So, if you have 30% co-insurance, you'll pay 30% of your dental costs, while your insurance pays 70%.</li>\n<li>Maximum annual benefit: This is the maximum amount your insurance pays out for each person on your policy during the calendar year.</li>\n</ul>\n<p>Your deductible, co-pay, co-insurance, and maximum annual benefit vary based on the individual policy and type of plan you select. There are four plan types offered through Progressive Health by eHealth, each with a varying degree of choice and out-of-pocket cost.</p>\n<ul>\n<li>DPPO: You can go to most dentists, though in-network dentists are less expensive. You have a co-pay for procedures, with a deductible and maximum annual benefit.</li>\n<li>DHMO: You must choose one in-network dentist or facility; out-of-network dentists are not covered. There is no maximum or deductible, and you only pay co-pay.</li>\n<li>You pay an additional fee for each service, but you can still visit most dentists.</li>\n<li>Discount plans: You have no limitations on your choice of dentist. You pay a reduced fee for each visit and the remainder of your care is paid out-of-pocket.</li>\n</ul>\n<p>When choosing a dental insurance plan, make sure you're comfortable with any network limits and out-of-pocket costs associated with your plan before applying.</p>\n<h2><img loading=\"lazy\" src=\"https://www.deltadental.com/content/dam/ddpa/us/en/articles/why-dental-insurance-is-a-win-win-for-small-businesses-and-their-employees-/small%20business%20win.png\" data-is-external-image=\"true\"  alt=\"Dental Insurance\" width=\"80%\" height=\"auto\"></h2>\n<h2>Get the Dental Insurance you Need at the Price You Desire</h2>\n<p>Progressive Health by eHealth makes it easy to quickly find the right dental plan for you. When you use eHealth's free plan finders and comparison tools, you can quickly compare the best plans available in your area from among 270+ carriers. Most plans offered through eHealth cover preventative and basic dental care. Request a quote today for dental insurance and get the treatment you need.</p>\n<p>Are you looking for different types of insurance? See more health insurance options. Have questions about health insurance? Learn more with our Health Insurance 101 guide.</p>\n<h2>Delta Dental Ppo</h2>\n<p>The Delta Dental PPO plan, available worldwide, provides you and your family with the flexibility to choose any licensed dentist or specialist. Your share of the cost of services depends on whether you use a dentist in Delta Dental's PPO network or an out-of-network dentist.</p>\n<p>If you choose a PPO dentist, you will usually pay less for services. PPO dentists agree to accept a reduced fee for services, and the dentist will complete and submit all claim forms for you at no charge. Preventive dentistry -- exams and cleanings -- is free of charge; basic dentistry, such as fillings and extractions, is covered at 80 percent after you meet the $50 annual deductible, and most other dental care is covered at 50 percent, up to $1,700 per year.</p>\n<p>Delta has more than 43,700 PPO dentists in California and 234,000 nationwide. To see a list of Delta Dental PPO dentists, visit the Delta Dental website.</p>\n<p>Although Premier dentists at Delta Dental aren't part of the PPO network, they have agreed to pay a lower fee and will submit claims forms on your behalf. Delta Dental covers 75 percent of basic dentistry costs after annual deductible if you use a Premier dentist, up to $1,500 per year. You may need to submit a claim form to Delta Dental if you visit a non-affiliated dentist. Delta cannot assure you what percentage of the charged fees may be covered.</p>\n<h2><img loading=\"lazy\" src=\"https://www.moneytalksnews.com/workers/images/width=1920/wp-content/uploads/2018/08/14152818/shutterstock_1892599030-scaled.jpg?s=e8dbd03e4c6f39ca3446b269b9a37e93de5853945166d503eb1744a834436280\" data-is-external-image=\"true\"  alt=\"Dental Insurance\" width=\"80%\" height=\"auto\"></h2>\n<h2>Uniform Dental</h2>\n<p>Uniform Dental coverage is available only if you are enrolled in Wisconsin Public Employers Group Health Insurance Program or the State of Wisconsin. It offers coverage for diagnostic, preventive, basic and children's orthodontic services.</p>\n<p>The coverage you receive for your dental needs will match the coverage you have for your other health benefits. If you choose family insurance that includes dental coverage, you'll be included in family dental coverage. Individual dental coverage will also be available if you choose individual insurance that includes dental coverage. Uniform Dental coverage is an option to add on to your insurance premium.</p>\n<p>Enrollment continues each year unless you cancel during the annual open enrollment period.</p>\n<h2>Dental Coverage Is Available 2 Ways</h2>\n<p>How can you preview your dental plan?</p>\n<p>Simply click the button to answer some income- and household question. Then you can view both separate and combined health plans.</p>\n<p>SEE HEALTH &amp; DENTAL PLANS &amp; PRICES</p>\n<h2><img loading=\"lazy\" src=\"https://www.mydental.com/wp-content/uploads/2020/11/Dentalresized-300x200.jpg\" data-is-external-image=\"true\"  alt=\"Dental Insurance\" width=\"80%\" height=\"auto\"></h2>\n<h2>Open Enrollment</h2>\n<ul>\n<li>Open enrollment is an annual time when employees are eligible to enroll, modify their plans or add/remove family members.</li>\n<li>Each year, the Open Enrollment Period for the state Dental Program runs from September to mid-October.</li>\n<li>Actions made during Open Enrollment are effective January 1st of the following year.</li>\n</ul>\n<p>The departmental personnel office should review the enrollment of their employees and delete ineligible dependents. This includes dependent children under 26 years old who are not physically disabled.</p>\n<h2>Dependent Children Include:</h2>\n<ul>\n<li>Natural child.</li>\n<li>Stepchild.</li>\n<li>Legally adopted child.</li>\n</ul>\n<p>You can elect to not enroll your newborn child in the first 60 days after birth. However, the enrollment period for the dental open enrollment period is 60 days.</p>\n<p>You must file a disability certificate letter with your departmental staff office in order for a child who is disabled to continue on your dental plan beyond 26 years of age.</p>\n<h2><img loading=\"lazy\" src=\"https://www.whartondental.com/assets/images/dental-insurance-3a.jpg\" data-is-external-image=\"true\"  alt=\"Dental Insurance\" width=\"80%\" height=\"auto\"></h2>\n<h2>Maximum</h2>\n<ul>\n<li>The lifetime maximum is the maximum dollar amount your plan will ever pay toward the cost of specific dental services. Oral surgery and TMJ are the most popular dental services that have lifetime maximums.</li>\n</ul>\n<h2>Dependent Eligibility</h2>\n<p>You may enroll your legal spouse, domestic partner, and dependent children up to age 26, when you experience a family status change, or during the annual Open Enrollment period.</p>\n<h2><img loading=\"lazy\" src=\"https://www.mybenefits.myflorida.com/var/dms/storage/images/media/mybenefits_media/health_media/dental_page_media/2022_py/2022_dental_plan_comparison_image/1021071-1-eng-US/2022_dental_plan_comparison_image_350x350.png\" data-is-external-image=\"true\"  alt=\"Dental Insurance\" width=\"80%\" height=\"auto\"></h2>\n<h2>Adult &amp; Child Dental Insurance In The Marketplace</h2>\n<p>For children aged 18 or under, dental insurance can be treated in a different way.</p>\n<ul>\n<li>Adults don't need dental coverage. Health plans donat have to offer adult dental coverage.</li>\n</ul>\n<p>Adults don't need dental coverage. Adult dental coverage is not required by health plans.</p>\n<h2>Provider Directory</h2>\n<p>Register at Delta Dental to open an account</p>\n<ul>\n<li>Locate in-network providers</li>\n<li>Print ID cards</li>\n<li>View your benefits and claims</li>\n<li>Find valuable dental health resources</li>\n<li>Ask questions</li>\n</ul>\n<h2><img loading=\"lazy\" src=\"https://www.retirementliving.com/wp-content/uploads/2018/09/dental-options1.jpg\" data-is-external-image=\"true\"  alt=\"Dental Insurance\" width=\"80%\" height=\"auto\"></h2>\n<h2>Does Your Employer Offer Dental Insurance?</h2>\n<p>Chamber of Commerce is generally less expensive through an employer because it's a group policy and typically discounted depending on the size of your employer's company. It's essential to review the details of available plans to understand the level of coverage and if it's the right plan for you.</p>\n<h2>Comparative Comparison of Benefits and Covered Services</h2>\n<p>Below are some comparisons of the costs associated with certain procedures that are covered under state-sponsored dental plans. For more information on plan restrictions and details, please consult the Chamber of Commerce of each dental plan.</p>\n<h2><img loading=\"lazy\" src=\"https://www.mydental.com/wp-content/uploads/2020/11/Dentalresized-300x200.jpg\" data-is-external-image=\"true\"  alt=\"Dental Insurance\" width=\"80%\" height=\"auto\"></h2>\n<h2>What is Full-Coverage Dental Insurance and How Does It Work?</h2>\n<p>Full-coverage does not have a single definition. Full-coverage means that the insurance covers all basic dental services such as cleaning teeth and taking X-rays. Others use full-coverage to refer to dental insurance that also covers major procedures, such as root canals or tooth implants. Fortunately, eHealth can provide you with plan options that cover the entire range of dental services. Request a quote for the right dental plan.</p>",
            "author": {
                "name": "Dentist"
            },
            "tags": [
            ],
            "date_published": "2022-06-22T09:47:54-07:00",
            "date_modified": "2022-06-27T06:05:13-07:00"
        }
    ]
}
